<!-- azurenoops/terraform-github-actions {"workspace":"default","backend_type":"azurerm","backend":"d8deb04c44e443c0db9792d2811d1402bb6872d9f018e8e54412bb8f5b656c32","plan_job_ref":"Job Create MPE Management terraform plan #46 at https://github.com/AFMPE/mpe_management/actions/runs/4828182694","plan_hash":"8ef0fa5f73ea5a9c6182037637f695343a2294b507539226688631075ad87c64","plan_text_format":"text","version":"99.0.0"} -->
Terraform plan in __src__
With backend config: `storage_account_name=afmpetfmgtprodh8dc4qua
container_name=core-mgt-prod-tfstate            
resource_group_name=afmpe-network-artifacts-rg
`
With var files: `src/tfvars/production/parameters.prod.tfvars
`<details open><summary>With variables</summary>

```hcl
state_sa_container_name           = (sensitive value)
state_sa_name                     = (sensitive value)
state_sa_rg                       = (sensitive value)
subscription_id_hub               = (sensitive value)
subscription_id_internal          = (sensitive value)
subscription_id_partners_gsa_dev  = (sensitive value)
subscription_id_partners_gsa_prod = (sensitive value)
subscription_id_sandbox           = (sensitive value)
```
</details>
<details>
<summary>Plan: 13 to add, 2 to change, 1 to destroy.</summary>

```hcl
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
-/+ destroy and then create replacement
 <= read (data resources)

Terraform will perform the following actions:

  # module.mod_sentinel_rule_alerts.data.azurerm_client_config.current will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "azurerm_client_config" "current" {
      + client_id       = (known after apply)
      + id              = (known after apply)
      + object_id       = (known after apply)
      + subscription_id = (known after apply)
      + tenant_id       = (known after apply)
    }

  # module.mod_sentinel_rule_alerts.azurerm_sentinel_data_connector_azure_active_directory.dataAAD will be created
  + resource "azurerm_sentinel_data_connector_azure_active_directory" "dataAAD" {
      + id                         = (known after apply)
      + log_analytics_workspace_id = "******************************************************************************************************************************************************************************************"
      + name                       = "Azure_AD_Connector"
      + tenant_id                  = (known after apply)
    }

  # module.mod_sentinel_rule_alerts.azurerm_sentinel_data_connector_azure_advanced_threat_protection.dataATP will be created
  + resource "azurerm_sentinel_data_connector_azure_advanced_threat_protection" "dataATP" {
      + id                         = (known after apply)
      + log_analytics_workspace_id = "******************************************************************************************************************************************************************************************"
      + name                       = "ATP_Connector"
      + tenant_id                  = (known after apply)
    }

  # module.mod_sentinel_rule_alerts.azurerm_sentinel_data_connector_dynamics_365.dataD365 will be created
  + resource "azurerm_sentinel_data_connector_dynamics_365" "dataD365" {
      + id                         = (known after apply)
      + log_analytics_workspace_id = "******************************************************************************************************************************************************************************************"
      + name                       = "D365_Connetor"
      + tenant_id                  = (known after apply)
    }

  # module.mod_sentinel_rule_alerts.azurerm_sentinel_data_connector_microsoft_cloud_app_security.dataCAS will be created
  + resource "azurerm_sentinel_data_connector_microsoft_cloud_app_security" "dataCAS" {
      + alerts_enabled             = true
      + discovery_logs_enabled     = true
      + id                         = (known after apply)
      + log_analytics_workspace_id = "******************************************************************************************************************************************************************************************"
      + name                       = "CAS_Connector"
      + tenant_id                  = (known after apply)
    }

  # module.mod_sentinel_rule_alerts.azurerm_sentinel_data_connector_microsoft_defender_advanced_threat_protection.dataDATP will be created
  + resource "azurerm_sentinel_data_connector_microsoft_defender_advanced_threat_protection" "dataDATP" {
      + id                         = (known after apply)
      + log_analytics_workspace_id = "******************************************************************************************************************************************************************************************"
      + name                       = "DATP_Connector"
      + tenant_id                  = (known after apply)
    }

  # module.mod_sentinel_rule_alerts.azurerm_sentinel_data_connector_microsoft_threat_intelligence.dataMTI must be replaced
-/+ resource "azurerm_sentinel_data_connector_microsoft_threat_intelligence" "dataMTI" {
      + bing_safety_phishing_url_lookback_date       = "1970-01-01T00:00:00Z" # forces replacement
      ~ id                                           = "*************************************************************************************************************************************************************************************************************************************************************" -> (known after apply)
        name                                         = "MSTI_Connector"
      ~ tenant_id                                    = "************************************" -> (known after apply)
        # (2 unchanged attributes hidden)
    }

  # module.mod_sentinel_rule_alerts.azurerm_sentinel_data_connector_microsoft_threat_protection.dataMTP will be created
  + resource "azurerm_sentinel_data_connector_microsoft_threat_protection" "dataMTP" {
      + id                         = (known after apply)
      + log_analytics_workspace_id = "******************************************************************************************************************************************************************************************"
      + name                       = "MTP_Connector"
      + tenant_id                  = (known after apply)
    }

  # module.mod_sentinel_rule_alerts.azurerm_sentinel_data_connector_office_365.dataO365 will be created
  + resource "azurerm_sentinel_data_connector_office_365" "dataO365" {
      + exchange_enabled           = true
      + id                         = (known after apply)
      + log_analytics_workspace_id = "******************************************************************************************************************************************************************************************"
      + name                       = "O365_Connector"
      + sharepoint_enabled         = true
      + teams_enabled              = true
      + tenant_id                  = (known after apply)
    }

  # module.mod_sentinel_rule_alerts.azurerm_sentinel_data_connector_office_365_project.dataO365P will be created
  + resource "azurerm_sentinel_data_connector_office_365_project" "dataO365P" {
      + id                         = (known after apply)
      + log_analytics_workspace_id = "******************************************************************************************************************************************************************************************"
      + name                       = "O365P_Connector"
      + tenant_id                  = (known after apply)
    }

  # module.mod_sentinel_rule_alerts.azurerm_sentinel_data_connector_office_atp.dataOATP will be created
  + resource "azurerm_sentinel_data_connector_office_atp" "dataOATP" {
      + id                         = (known after apply)
      + log_analytics_workspace_id = "******************************************************************************************************************************************************************************************"
      + name                       = "OATP_Connector"
      + tenant_id                  = (known after apply)
    }

  # module.mod_sentinel_rule_alerts.azurerm_sentinel_data_connector_office_irm.dataOIRM will be created
  + resource "azurerm_sentinel_data_connector_office_irm" "dataOIRM" {
      + id                         = (known after apply)
      + log_analytics_workspace_id = "******************************************************************************************************************************************************************************************"
      + name                       = "OIRM_Connector"
      + tenant_id                  = (known after apply)
    }

  # module.mod_sentinel_rule_alerts.azurerm_sentinel_data_connector_office_power_bi.dataOPBI will be created
  + resource "azurerm_sentinel_data_connector_office_power_bi" "dataOPBI" {
      + id                         = (known after apply)
      + log_analytics_workspace_id = "******************************************************************************************************************************************************************************************"
      + name                       = "OPBI_Connector"
      + tenant_id                  = (known after apply)
    }

  # module.mod_sentinel_rule_alerts.azurerm_sentinel_data_connector_threat_intelligence.dataTI will be created
  + resource "azurerm_sentinel_data_connector_threat_intelligence" "dataTI" {
      + id                         = (known after apply)
      + log_analytics_workspace_id = "******************************************************************************************************************************************************************************************"
      + lookback_date              = "1970-01-01T00:00:00Z"
      + name                       = "TI_Connector"
      + tenant_id                  = (known after apply)
    }

  # module.landing_zone.module.mod_operational_logging.azurerm_security_center_subscription_pricing.main["StorageAccounts"] will be updated in-place
  ~ resource "azurerm_security_center_subscription_pricing" "main" {
        id            = "/subscriptions/7eb60145-02f2-4fc1-80d2-e25d2ce9e45d/providers/Microsoft.Security/pricings/StorageAccounts"
      - subplan       = "PerTransaction" -> null
        # (2 unchanged attributes hidden)
    }

  # module.landing_zone.module.mod_operational_logging.azurerm_security_center_subscription_pricing.main["VirtualMachines"] will be updated in-place
  ~ resource "azurerm_security_center_subscription_pricing" "main" {
        id            = "/subscriptions/7eb60145-02f2-4fc1-80d2-e25d2ce9e45d/providers/Microsoft.Security/pricings/VirtualMachines"
      - subplan       = "P2" -> null
        # (2 unchanged attributes hidden)
    }

Plan: 13 to add, 2 to change, 1 to destroy.
```
</details>

:memo: Plan generated in [Create MPE Management terraform plan #46](https://github.com/AFMPE/mpe_management/actions/runs/4828182694)